In [2]:
import pandas as pd

## Insert row at top/start of df

## pd.conact()

In [3]:
df = pd.DataFrame({'Date':['10/2/2011', '12/2/2011', '13/2/2011', '14/2/2011'],
                    'Event':['Music', 'Poetry', 'Theatre', 'Comedy'],
                    'Cost':[10000, 5000, 15000, 2000]})
 
df

        Date    Event   Cost
0  10/2/2011    Music  10000
1  12/2/2011   Poetry   5000
2  13/2/2011  Theatre  15000
3  14/2/2011   Comedy   2000

In [12]:
top_row=pd.DataFrame({'Date':'09/2/2011','Event':'Dance','Cost':200000},index=[0])
top_row

        Date  Event    Cost
0  09/2/2011  Dance  200000

In [13]:
pd.concat([top_row,df])

        Date    Event    Cost
0  09/2/2011    Dance  200000
0  10/2/2011    Music   10000
1  12/2/2011   Poetry    5000
2  13/2/2011  Theatre   15000
3  14/2/2011   Comedy    2000

In [14]:
pd.concat([top_row,df]).reset_index(drop=True)

        Date    Event    Cost
0  09/2/2011    Dance  200000
1  10/2/2011    Music   10000
2  12/2/2011   Poetry    5000
3  13/2/2011  Theatre   15000
4  14/2/2011   Comedy    2000

In [15]:
pd.concat([top_row,df],ignore_index=True)

        Date    Event    Cost
0  09/2/2011    Dance  200000
1  10/2/2011    Music   10000
2  12/2/2011   Poetry    5000
3  13/2/2011  Theatre   15000
4  14/2/2011   Comedy    2000

### There does not exist any in-built function in pandas which will help us to insert a row at any specific position in the given dataframe. So, we are going to write our own customized function to achieve the result.
Note : Inserting rows in-between the rows in Pandas Dataframe is an inefficient operation and the user should avoid it.

In [16]:
df

        Date    Event   Cost
0  10/2/2011    Music  10000
1  12/2/2011   Poetry   5000
2  13/2/2011  Theatre  15000
3  14/2/2011   Comedy   2000